[
    {
    "date": "Nov 2024 - Present",
    "Organisation": "OP Financial Group | Tata Consultancy Services",
    "location": "Helsinki, FI",
    "Role": "Senior Full Stack Developer",
    "url": "https://www.op.fi//",
    "workDetails": [
      {
        "title": "Responsibilities",
        "list": [
          "▸ Analyze and resolve critical performance bottlenecks, improving application scalability, responsiveness, and overall system reliability.",
		      "▸ Designe and develop RESTful APIs using Spring Boot, enabling seamless integration and supporting complex client-side functionality.",
		      "▸ Streamline and guide agile development processes for offshore teams, improving sprint efficiency, delivery predictability, and cross-team collaboration.",
          "▸ Establish CI/CD pipelines to improve application integration and deployment reliability."
        ]
      },
      {
        "title": "Projects",
        "list": [
          "▸ TCS BaNCS: A banking product implemented for OP Financial Group (client)."
        ]

      },
      {
        "title": "Achievements",
        "list": [
          "▸ Played a key role in orchestrating the migration of applications from on-premises infrastructure to Microsoft Azure.",
          "▸ Designed and implemented a highly available (HA) JMS and Kafka cluster to ensure fault tolerance and high throughput."
        ]
      }
    ]
  },
  {
    "date": "Aug 2021 - Nov 2024",
    "Organisation": "Tata Consultancy Services",
    "location": "Bengaluru, IN",
    "Role": "Full Stack Developer",
    "url": "https://www.tcs.com/",
    "workDetails": [
      {
        "title": "Responsibilities",
        "list": [
          "▸ Create new pages, integrate APIs and add functionalities using Struts framework, Java and Javascript.",
		  "▸ Created REST API endpoints using Spring Boot to implement required client functionality.",
		  "▸ Write high quality maintainable code.",
          "▸ Train and provide K.T. to junior devs and ensure their project readiness."
        ]
      },
      {
        "title": "Projects",
        "list": [
          "▸ TCS BaNCS: A banking product implemented for OP Financial Group (client).",
          "▸ DevTools: A multi functional tool implemented to streamline manual tasks."
        ]

      },
      {
        "title": "Achievements",
        "list": [
          "▸ Received 'Star of the Month' for completing mutilple complex user stories in the absence of a senior resource.",
          "▸ Cleared TCS's Wings exam on MERN Stack and received a Hi-Talent tag.",
          "▸ Single-handedly designed and implemented a tool with multiple functionality which streamlined several multi-step manual processes into a single-click solution, significantly enhancing workflow efficiency of developers and testers."
        ]
      }
    ]
  }
]
